/* Invalid BP Reading Component Alert Title */
"INVALID_BP_READING_COMPONENT_ALERT_TITLE" = "Invalid %@ Reading!";

/* OK button label */
"OK_BUTTON_LABEL" = "OK";

/* Systolic BP Reading Component Name */
"SYSTOLIC_COMPONENT_NAME" = "Systolic";

/* Diastolic BP Reading Component Name */
"DIASTOLIC_COMPONENT_NAME" = "Diastolic";

/* Pulse BP Reading Component Name */
"PULSE_COMPONENT_NAME" = "Pulse";

/* Weight Component Name */
"WEIGHT_COMPONENT_NAME" = "Weight";

/* Invalid BP Reading Component Message */
"BP_READING_COMPONENT_OUT_OF_RANGE" = "%@ Pressure Reading must be in the range %hi to %hi";

/* Invalid Pulse Reading Message */
"PULSE_READING_OUT_OF_RANGE" = "%@ Reading must be in the range %hi to %hi";

/* Invalid Weight Message */
"WEIGHT_OUT_OF_RANGE" = "%@ must not be less than %hi";

/* Blood Pressure Readings List View Title */
"BP_READINGS_LIST_TITLE" = "Blood Pressure Log";

/* Export Data View Controller Title */
"EXPORT_DATA_CONTROLLER_TITLE" = "Export Data";

/* Reminder View Controller Title */
"REMINDER_CONTROLLER_TITLE" = "Reminders";

/* Reminder all day event format string */
"ALL_DAY_REMINDER_EVENT" = "All day %@";

/* Reminder event format string */
"REMINDER_EVENT_DATE_TIME" = "%1$@ for %2$@";

/* Multiple interval - multi-frequency recurrence such as Every 3 Days */
"MULTI-INTERVAL_MULTI-FREQUENCY_RECURRENCE" = "%1$d %2$@";

/* Multiple interval - multi-frequency recurrency such as Every n 'units' */
"MULTI-INTERVAL_SINGLE-FREQUENCY_RECURRENCE" = "%@";

/* Event is all day and reoccurs */
"ALL_DAY_RECUR_EVENT" = "All day starting from %1$@ and repeats every %2$@";

/* Event is all day and repeats until an end date. */
"ALL_DAY_RECUR_EVENT_UNTIL_END_DATE" = "All day starting from %1$@ and repeats every %2$@ until %3$@";

/* Event is all day and repeats until an end date. */
"ALL_DAY_RECUR_EVENT_UNTIL_OCCURENCES_REACHED" = "All day starting from %@ and repeats every %1$@ for %2$@";

/* Event that starts at a date and repeats at a given interval and freq. */
"RECUR_EVENT" = "Starts %1$@ for %2$@ and repeats every %3$@";

/* Event that starts at a date and repeats at a given interval and freq. until an end date */
"RECUR_EVENT_UNTIL_END_DATE" = "Starts %1$@ for %2$@ and repeats every %3$@ until %4$@";

/* Event that starts at a date and repeats at a given interval and freq. until an end date */
"RECUR_EVENT_UNTIL_OCCURENCES_REACHED" = "Starts %1$@ for %2$@ and repeats every %3$@ for %4$@";

/* Duration months - days - hours - mins - secs */
"DURATION_MONTHS_DAYS_HOURS_MINUTES_SECONDS" = "%1$d month(s) %2$d day(s) %3$d hour(s) %4$d min(s) %5$d sec(s)";

/* Duration months - days - hours - mins - secs */
"DURATION_DAYS_HOURS_MINUTES_SECONDS" = "%1$d day(s) %2$d hour(s) %3$d min(s) %4$d sec(s)";

/* Duration months - days - hours - mins - secs */
"DURATION_HOURS_MINUTES_SECONDS" = "%1$d hour(s) %2$d min(s) %3$d sec(s)";

/* Duration months - days - hours - mins - secs */
"DURATION_MINUTES_SECONDS" = "%1$d min(s) %2$d sec(s)";

/* Duration months */
"DURATION_MONTHS" = "%1$d month(s)";

/* Duration days */
"DURATION_DAYS" = "%1$d day(s)";

/* Duration hours */
"DURATION_HOURS" = "%1$d hour(s)";

/* Duration minutes */
"DURATION_MINUTES" = "%1$d min(s)";

/* Single Day */
"DAY" = "day";

/* Single Week */
"WEEK" = "week";

/* Single Month */
"MONTH" = "month";

/* Single Year */
"YEAR" = "year";

/* Multiple Days */
"DAYS" = "days";

/* Multiple Weeks */
"WEEKS" = "weeks";

/* Multiple months */
"MONTHS" = "months";

/* Multiple Years */
"YEARS" = "years";

/* Titles for the CSV Blood Pressure Log */
"CSV_DATE_FIELD_TITLE" = "Date";
"CSV_PULSE_FIELD_TITLE" = "Pulse";
"CSV_SYSTOLIC_FIELD_TITLE" = "Systolic";
"CSV_DIASTOLIC_FIELD_TITLE" = "Diastolic";
"CSV_WEIGHT_FIELD_TITLE" = "Weight";
"CSV_NOTE_FIELD_TITLE" = "Notes";

/* Export Data User Error Title */
"EXPORT_DATA_USER_ERROR_TITLE" = "Export Blood Pressure Error";

/* Export Data Failure Title */
"EXPORT_DATA_FAILURE_ALERT_TITLE" = "Export Blood Pressure Data Failure";

/* Export Data Fetch Failure Title */
"EXPORT_DATA_FETCH_FAILURE_TITLE" = "Failure Fetching Blood Pressure Reading Data";

/* Export Data Failure Messages */
"EXPORT_DATA_USER_ERROR_INVALID_DATE_RANGE" = "Start date must be less than or equal to end date.";

"TEMPORARY_DIR_NAME_RETRIEVAL_FAILURE_MSG" = "Couldn't retrieve temporary directory name.";

"EXPORT_DATA_FETCH_FAILURE_MSG" = "An error occurred during the attempt to retrieve blood pressure reading data from the database.";

"EXPORT_DATA_DEVICE_CANNOT_SENDMAIL" = "The device is not configured to send mail. Please set up email capability and try again.";

"EXPORT_DATA_CANNOT_CREATE_COMPOSE_MAIL_VIEW" = "Failure creating mail composer view."; 

"EXPORT_DATA_COMPOSE_MAIL_VIEW_ERROR" = "Error composing mail.";

/* Generic strings for displaying NSError information */
"ERROR_REASON_MSG" = "\nReason: %@";

"ERROR_DESC_MSG" = "\nDescription: %@";

"ERROR_RECOVERY_MSG" = "\nRecovery: %@";

"EXPORT_DATA_MAIL_SUBJECT" = "Blood Pressure Exported Readings";

"EXPORT_DATA_MAIL_MESSAGE_BODY" = "The attached file contains Blood Pressure Readings for the date range %@ to %@";

/* Strings used in creating NSError objects for reminder store failures */
"DELETE_REMINDER_FROM_REMINDER_STORE_FAILURE_DESCRIPTION" = "Deletion of reminder event failed: %@";

"SAVE_REMINDER_TO_REMINDER_STORE_FAILURE_DESCRIPTION" = "Save reminder failed: %@";

"ADD_REMINDER_TO_REMINDER_STORE_FAILURE_DESCRIPTION" = "Add reminder failed: %@";

"REMINDER_STORE_FAILURE_RECOVERY_SUGGESTION" = "Application must terminate. All unsaved changes will be reverted. Please re-start application.";

"DELETE_EVENT_FROM_CALENDAR_STORE_FAILURE" = "Failure deleting event from calendar store.";

"DELETE_REMINDER_METADATA_FAILURE" = "Failure deleting reminder event metadata.";

"SAVE_REMINDER_TO_CALENDAR_STORE_FAILURE" = "Save to calendar event store failed.";

"SAVE_REMINDER_METADATA_FAILURE_REASON" = "Reminder event metadata save failed.";

"ADD_REMINDER_TO_CALENDAR_STORE_FAILURE" = "Adding to calendar event store failed.";

"ADD_REMINDER_METADATA_FAILURE_REASON" = "Reminder event metadata save failed.";

/* Reminder Store Failure Title */
"READING_REMINDER_FAILURE_TITLE" = "Reminder Event Error";

